export const APP_DOCUMENTS_EXT = [
  {
    title: 'Строка вызова приложения'
  },
  {
    title: 'Параметры вызова'
  }
];

export const APP_DOCUMENTS_SEARCH = [
  {
    title: 'Отображать в результатах поиска максимальное количество записей' /*  в приложении Документы */
  },
  {
    title: 'Картотека для поиска РК по умолчанию' /*  в приложении Документы */
  }
];

export const CERTS = [
  {
    label: 'Название объекта:',
  }
];

export const TRANSFER_DOC = [
  {
    title: 'да'
  },
  {
    title: 'нет'
  },
  {
    title: 'не добавлять'
  },
  {
    title: 'для всех документов'
  },
  {
    title: 'только для документов с оригиналом на бумажном носителе'
  },
  {
    title: 'оригинал(ы)'
  },
  {
    title: 'копию(и)'
  },
  {
    title: 'первому оригинал(ы), остальным копии'
  },
  {
    title: 'вручную'
  },
  {
    title: 'без диалога'
  },
  {
    title: 'с диалогом'
  }
];

export const TRANSFER_ADDRESSES = [
  {
    title: 'Вид отправки'
  },
  {
    title: 'Отправить из'
  },
  {
    title: 'Эл. экземпляр(ы)'
  },
  {
    title: 'оригинал(ы)'
  },
  {
    title: 'копию(и)'
  },
  {
    title: 'первому оригинал(ы), остальным копии'
  },
  {
    title: 'не отмечать'
  },
  {
    title: 'Добавлять с отметкой об отправке в АРМ «ДелоWeb»'
  },
  {
    title: 'Использовать правило секции «Внутренние адресаты» об указании бумажного экземпляра в записях журнала передачи'
  },
  {
    title: 'Показывать информацию о томах в записях о списании в дело'
  },
  {
    title: 'оригинал(ы)'
  },
  {
    title: 'вручную'
  }
];

export const EXT_EXCHANGE_GENERAL = [
  {
    title: 'Скрыть операцию "Отправить E-mail"'
  },
  {
    title: 'Шифрование'
  },
  {
    title: 'Электронная подпись'
  },
  {
    title: 'Сжимать прикрепленные файлы'
  },
  {
    title: '  Учитывать вид отправки'
  },
  {
    title: 'Сообщить о доставке этого сообщения'
  },
  {
    title: 'Требуется уведомление о регистрации или отказе от нее'
  },
  {
    title: 'Адрес для квитанции о регистрации'
  }
];

export const EXT_EXCHANGE_PASSPORT = [
  {
    title: 'весь документ'
  },
  {
    title: 'выписку'
  },
  {
    title: 'Резолюции'
  },
  {
    title: 'где адресат - исполнитель'
  },
  {
    title: 'Адресаты'
  },
  {
    title: 'адресату - информация о себе'
  },
  {
    title: 'все'
  }
];

export const EXT_EXCHANGE_SENDING = [
  {
    title: 'Группа документов'
  },
  {
    title: 'Состав документа'
  },
  {
    title: 'Содержание'
  },
  {
    title: 'Признак коллективности (обращения гражданина)'
  },
  {
    title: 'Регистрационный №'
  },
  {
    title: 'Гриф доступа'
  },
  {
    title: 'Рубрики'
  },
  {
    title: 'Сопроводительные документы'
  },
  {
    title: 'Примечание к РК'
  },
  {
    title: 'Примечание к адресату сообщения'
  },
  {
    title: 'Автор документа'
  },
  {
    title: 'Визы'
  }
];

export const EXT_EXCHANGE_PARAMS = [
  {
    title: 'Удалить сообщение после регистрации'
  },
  {
    title: 'Удалить сообщение после отказа от регистрации'
  },
  {
    title: 'Уведомлять о регистрации или отказе от нее'
  },
  {
    title: 'Прикрепить к РК паспорт документа'
  },
  {
    title: 'Принимать рубрики РК'
  },
  {
    title: 'Заполнять информацию о сопроводительных документах'
  },
  {
    title: 'Автоматически добавлять организации и представителей в справочник «Организации»'
  },
  {
    title: 'Проверять ЭП сообщения'
  },
  {
    title: 'Проверять ЭП вложенных файлов'
  },
  {
    title: 'Проверять ЭП резолюции'
  },
  {
    title: 'Сообщать отправителю, если ЭП не действительна'
  },
  {
    title: 'Сообщать отправителю, если ЭП действительна'
  }
];
export const LK_EXCHANGE_PARAMS = [
    {
      title: 'Скрыть операцию отправки по ЛК без подготовки'
    },
];

export const EPVV_EXCHANGE_PARAMS = [
    {
      title: 'Скрыть операцию отправки по ЕПВВ без подготовки'
    },
];

export const SDS_EXCHANGE_PARAMS = [
    {
      title: 'Скрыть операцию отправки по СДС без подготовки'
    },
];
export const ASPSD_EXCHANGE_PARAMS = [
    {
      title: 'Скрыть операцию отправки по АС ПСД без подготовки'
    },
];
